**İleri Birleştirme (join) işlmeleri**

In [1]:
import pandas as pd

In [2]:
#birebir birleştirme

In [3]:
df1=pd.DataFrame({'calısanlar':['ali','Veli','ayse','Fatma'],
                 'grup':['muhasebe','muhendislik','muhendislik','İK']})
df1

  calısanlar         grup
0        ali     muhasebe
1       Veli  muhendislik
2       ayse  muhendislik
3      Fatma           İK

In [7]:
df2=pd.DataFrame({'calısanlar':['ali','Veli','ayse','Fatma'],
                 'ilk_giris':[2010,2009,2014,2019]})
df2

  calısanlar  ilk_giris
0        ali       2010
1       Veli       2009
2       ayse       2014
3      Fatma       2019

In [8]:
pd.merge(df1,df2)

  calısanlar         grup  ilk_giris
0        ali     muhasebe       2010
1       Veli  muhendislik       2009
2       ayse  muhendislik       2014
3      Fatma           İK       2019

#coktan teke

In [9]:
df3=pd.merge(df1,df2)

In [10]:
df3

  calısanlar         grup  ilk_giris
0        ali     muhasebe       2010
1       Veli  muhendislik       2009
2       ayse  muhendislik       2014
3      Fatma           İK       2019

In [11]:
df4=pd.DataFrame({'grup':['muhasebe','muhendislik','ik'],
                 'mudur':['caner','mustafa','berkcan']})
df4

          grup    mudur
0     muhasebe    caner
1  muhendislik  mustafa
2           ik  berkcan

In [12]:
pd.merge(df3,df4)

  calısanlar         grup  ilk_giris    mudur
0        ali     muhasebe       2010    caner
1       Veli  muhendislik       2009  mustafa
2       ayse  muhendislik       2014  mustafa

In [13]:
#coktan coka

In [18]:
df5=pd.DataFrame({'grup':['muhasebe','muhendislik','muhendislik','muhendislik','İK','İK'],
                 'yetenekler':['matematik','excel','kodlama','linux','excel','yonetim']})
df5

          grup yetenekler
0     muhasebe  matematik
1  muhendislik      excel
2  muhendislik    kodlama
3  muhendislik      linux
4           İK      excel
5           İK    yonetim

In [16]:
df1

  calısanlar         grup
0        ali     muhasebe
1       Veli  muhendislik
2       ayse  muhendislik
3      Fatma           İK

In [19]:
pd.merge(df1,df5)

  calısanlar         grup yetenekler
0        ali     muhasebe  matematik
1       Veli  muhendislik      excel
2       Veli  muhendislik    kodlama
3       Veli  muhendislik      linux
4       ayse  muhendislik      excel
5       ayse  muhendislik    kodlama
6       ayse  muhendislik      linux
7      Fatma           İK      excel
8      Fatma           İK    yonetim